# IsFailureResolutionPermitted Method (FailureMessageAccessor) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailuresAccessor..::..IsFailureResolutionPermitted Method (FailureMessageAccessor)
FailuresAccessor Class See Also
---
Checks if default resolution of the failure is permitted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsFailureResolutionPermitted(
	FailureMessageAccessor failure
)
```

Visual Basic
---
```text
Public Function IsFailureResolutionPermitted ( _
	failure As FailureMessageAccessor _
) As Boolean
```

Visual C++
---
```text
public:
bool IsFailureResolutionPermitted(
	FailureMessageAccessor^ failure
)
```

# ### Parameters
failure
    Type: Autodesk.Revit.DB..::..FailureMessageAccessor The accessor to the failure to be resolved.
# ### Return Value
True if default resolution of the failure is permitted
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | failure has not been properly initialized. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

# See Also
FailuresAccessor Class
IsFailureResolutionPermitted Overload
Autodesk.Revit.DB Namespace